In [1]:
##working on pandas
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1=pd.DataFrame([[1,2,3,4,],[8,6,2,6],[5,6,89,23],[5,1,41,87],[56,84,1,7],[4,8,9,7]],columns=['A','B','C','D'])

In [5]:
df1

    A   B   C   D
0   1   2   3   4
1   8   6   2   6
2   5   6  89  23
3   5   1  41  87
4  56  84   1   7
5   4   8   9   7

In [25]:
df1.head(3)

   A  B   C   D
0  1  2   3   4
1  8  6   2   6
2  5  6  89  23

In [26]:
df1.tail(3)

    A   B   C   D
3   5   1  41  87
4  56  84   1   7
5   4   8   9   7

In [27]:
df1.shape

(6, 4)

In [28]:
df1

    A   B   C   D
0   1   2   3   4
1   8   6   2   6
2   5   6  89  23
3   5   1  41  87
4  56  84   1   7
5   4   8   9   7

In [29]:
df1.iloc[0:3,0:3]

   A  B   C
0  1  2   3
1  8  6   2
2  5  6  89

In [33]:
df1[df1['A']>4]

    A   B   C   D
1   8   6   2   6
2   5   6  89  23
3   5   1  41  87
4  56  84   1   7

In [ ]:
##mean of A,B,C,D row

In [34]:
df1.mean()

A    13.166667
B    17.833333
C    24.166667
D    22.333333
dtype: float64

In [ ]:
#mean of 0,1,2,3,4,5 column

In [35]:
df1.mean(1)

0     2.50
1     5.50
2    30.75
3    33.50
4    37.00
5     7.00
dtype: float64

In [37]:
df1

    A   B   C   D
0   1   2   3   4
1   8   6   2   6
2   5   6  89  23
3   5   1  41  87
4  56  84   1   7
5   4   8   9   7

In [17]:
df1.apply(np.cumsum)#adding columns to previous columns

    A    B    C    D
0   1    2    3    4
1   9    8    5   10
2  14   14   94   33
3  19   15  135  120
4  75   99  136  127
5  79  107  145  134

In [18]:
df1.to_csv('export.csv')

In [39]:
df1.apply(lambda x: x.max()-x.min())

A    55
B    83
C    88
D    83
dtype: int64

In [8]:
import pandas as pd

In [11]:
df = pd.read_csv('data.csv')

In [13]:
#for openinig csv file we need to place csv file in cpp or where all vs code files are.

In [14]:
df.head()

,SYMBOL,SERIES,DATE1,PREV_CLOSE,OPEN_PRICE,HIGH_PRICE,LOW_PRICE,LAST_PRICE,CLOSE_PRICE,AVG_PRICE,TTL_TRD_QNTY,TURNOVER_LACS,NO_OF_TRADES,DELIV_QTY,DELIV_PER
0,20MICRONS,EQ,23-Apr-2021,36.00,36.75,36.75,35.40,36.50,36.30,35.95,65388,23.51,669,43464,66.47
1,21STCENMGM,EQ,23-Apr-2021,12.10,12.25,12.25,11.90,11.90,11.90,11.99,5006,0.60,43,3678,73.47
2,3IINFOTECH,EQ,23-Apr-2021,7.00,7.00,7.10,6.80,6.90,6.85,6.96,9018770,627.54,5773,6844996,75.9
3,3MINDIA,EQ,23-Apr-2021,27004.05,26752.00,27200.00,26201.00,26340.00,26378.00,26705.53,2935,783.81,1748,878,29.91
4,3PLAND,EQ,23-Apr-2021,9.45,9.45,9.85,9.25,9.85,9.70,9.63,10989,1.06,77,7498,68.23

In [16]:
print(df[' PREV_CLOSE'])

0          36.00
1          12.10
2           7.00
3       27004.05
4           9.45
          ...
1995       25.85
1996      166.50
1997       90.30
1998       78.00
1999     2072.10
Name:  PREV_CLOSE, Length: 2000, dtype: float64